## 1 SQL Databases

## 2 Working With Json

## 3 Json API
https://api.exchangerate-api.com/v4/latest/INR

    
    
## 4 CSV Files with different parameters

# 1 Working With Databases

In [9]:
# !pip install mysql-connector-python

In [8]:
import mysql.connector 
import pandas as pd 


# make connection
con = mysql.connector.connect(host='localhost',user='root',password='',database='dummy_db')

In [6]:
con

In [10]:
df = pd.read_sql_query('SELECT * FROM mytabel', con)

C:\Users\Noor Saeed\AppData\Local\Temp\ipykernel_12876\3641102853.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM mytabel', con)

In [11]:
df

Empty DataFrame
Columns: [id, name, age, gender]
Index: []

# 2. working with json

In [12]:
df = pd.read_json("lec 17, dataset2.json")

In [13]:
df

          id      cuisine                                        ingredients
0      10259        greek  [romaine lettuce, black olives, grape tomatoes...
1      25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2      20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3      22213       indian                [water, vegetable oil, wheat, salt]
4      13162       indian  [black pepper, shallots, cornflour, cayenne pe...
...      ...          ...                                                ...
39769  29109        irish  [light brown sugar, granulated sugar, butter, ...
39770  11462      italian  [KRAFT Zesty Italian Dressing, purple onion, b...
39771   2238        irish  [eggs, citrus fruit, raisins, sourdough starte...
39772  41882      chinese  [boneless chicken skinless thigh, minced garli...
39773   2362      mexican  [green chile, jalapeno chilies, onions, ground...

[39774 rows x 3 columns]

# 3 Working With API

In [14]:
import pandas as pd
import requests
response = requests.get('https://api.themoviedb.org/3/movie/top_rated?api_key=8265bd1679663a7ea12ac168da84d2e8&language=en-US&page=1')

response

In [15]:
temp_df = pd.DataFrame(response.json()['results'])[['id','title','overview','release_date','popularity','vote_average','vote_count']]
temp_df.head()

,id,title,overview,release_date,popularity,vote_average,vote_count
0,278,The Shawshank Redemption,Imprisoned in the 1940s for the double murder ...,1994-09-23,34.8987,8.710,28347
1,238,The Godfather,"Spanning the years 1945 to 1955, a chronicle o...",1972-03-14,31.9184,8.686,21472
2,240,The Godfather Part II,In the continuing saga of the Corleone crime f...,1974-12-20,16.5668,8.600,12972
3,424,Schindler's List,The true story of how businessman Oskar Schind...,1993-12-15,18.8988,8.565,16449
4,389,12 Angry Men,The defense and the prosecution have rested an...,1957-04-10,15.7932,8.547,9143

# CSV Files with paramters

In [45]:
df = pd.read_csv("lec 17, dataset.csv", nrows=100, usecols=['Name','Sex','Age'])
df

                                                 Name     Sex   Age
0                                    Kelly, Mr. James    male  34.5
1                    Wilkes, Mrs. James (Ellen Needs)  female  47.0
2                           Myles, Mr. Thomas Francis    male  62.0
3                                    Wirz, Mr. Albert    male  27.0
4        Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0
..                                                ...     ...   ...
95                         Tenglin, Mr. Gunnar Isidor    male  25.0
96  Cavendish, Mrs. Tyrell William (Julia Florence...  female  76.0
97                          Makinen, Mr. Kalle Edvard    male  29.0
98                       Braf, Miss. Elin Ester Maria  female  20.0
99                       Nancarrow, Mr. William Henry    male  33.0

[100 rows x 3 columns]

In [44]:
# encoding 

# utf-8
# latin1
df = pd.read_csv('lec 17, dataset3.csv', encoding='utf-8')

df

       Name  Age       Country            Remarks  Salary
0      José   28        Brazil    Bom funcionário   45000
1    Müller   35       Germany           Sehr gut   52000
2  François   40        France  Excellent travail   58000
3        李雷   30         China              优秀的员工   49000
4  O’Connor   25       Ireland               Good   42000
5      Иван   38        Russia            Отлично   51000
6     Renée   32        Canada          Très bien   47000
7       علي   29  Saudi Arabia            جيد جدا   44000
8     Søren   45       Denmark          Meget god   56000
9     Nuñez   33        Mexico          Muy bueno   46000

In [32]:
# read data in chunks 

dfs = pd.read_csv('lec 17, dataset.csv',chunksize=50)
for chunk in dfs:
    print(chunk.shape)

(50, 12)
(50, 12)
(50, 12)
(50, 12)
(50, 12)
(50, 12)
(50, 12)
(50, 12)
(18, 12)